package Lessons_Topic.OOP.Lesson8.constructor_task;
//написати метод за допомогою якого  буде виводити сповіщення о том потріно людини яка владіє автівкою і має договір з
// автосервісом  перед подорожжю в будь-яке місто пройти ТО.
//Рішення о том ,чи потрібно проходити ТО проходить в автосервісе. Для цього у людини повинен бути укладен контракт.
//В контракті вказано ID цього контракту,та закріплений до нього людина з Ім'ям.
// В кожної автівки є ціна, назва, пробіг, пробіг на момент фінального ТО, та расстояніе посля проїзду котрого автівка пов инна пройти ТО.
// Автівка закріплина за  конкретною людиною
//Якщо в подорожі в якесь місто, пробіг після фінального ТО привищує расстояніе після проїзду котрого авто повинно
// пройти ТО. ТО на консоль виводиться сповіщення типу:
//Уважаємий {Ім'я людини}.
//Пееред тим як ви поїдите до {Назва міста} вам необхідно пройти ТО..
//
//Уважаємий {Ім'я людини}.
//Їд'те в {Назва міста}. Але не забувайте, що згодно з договіром {id договіра}
//ви обслуговуєтесь в нас.
//Ваш {Назва сервісу}
public class main {
    public static void main(String[] args) {
        Servis servis = new Servis("Шаловливая компрессия");
        servis.readyForService(new Contract(112233,
                        new Human("Siarhei",
                                new Auto("Renault",2000,13000,14000,23000)))
                ,new City("Киев",5000));
    }
}
